RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7200_320_bga.c
/* Connections for: pass_sar_ext_mux_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sar_ext_mux_en[3] = {
    {0u, 0u, P4_3, P4_3_PASS0_SAR_EXT_MUX_EN0},
    {0u, 1u, P12_2, P12_2_PASS0_SAR_EXT_MUX_EN1},
    {0u, 2u, P13_3, P13_3_PASS0_SAR_EXT_MUX_EN2},
};

/* Connections for: pass_sar_ext_mux_sel */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sar_ext_mux_sel[9] = {
    {0u, 0u, P4_0, P4_0_PASS0_SAR_EXT_MUX_SEL0},
    {0u, 1u, P4_1, P4_1_PASS0_SAR_EXT_MUX_SEL1},
    {0u, 2u, P4_2, P4_2_PASS0_SAR_EXT_MUX_SEL2},
    {0u, 3u, P12_3, P12_3_PASS0_SAR_EXT_MUX_SEL3},
    {0u, 4u, P12_4, P12_4_PASS0_SAR_EXT_MUX_SEL4},
    {0u, 5u, P12_5, P12_5_PASS0_SAR_EXT_MUX_SEL5},
    {0u, 6u, P13_0, P13_0_PASS0_SAR_EXT_MUX_SEL6},
    {0u, 7u, P13_1, P13_1_PASS0_SAR_EXT_MUX_SEL7},
    {0u, 8u, P13_2, P13_2_PASS0_SAR_EXT_MUX_SEL8},
};

/* Connections for: pass_sarmux_pads */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sarmux_pads[96] = {
    {0u, 0u, P6_0, HSIOM_SEL_GPIO},
    {0u, 1u, P6_1, HSIOM_SEL_GPIO},
    {0u, 2u, P6_2, HSIOM_SEL_GPIO},
    {0u, 3u, P6_3, HSIOM_SEL_GPIO},
    {0u, 4u, P6_4, HSIOM_SEL_GPIO},
    {0u, 5u, P6_5, HSIOM_SEL_GPIO},
    {0u, 6u, P6_6, HSIOM_SEL_GPIO},
    {0u, 7u, P6_7, HSIOM_SEL_GPIO},
    {0u, 16u, P7_0, HSIOM_SEL_GPIO},
    {0u, 17u, P7_1, HSIOM_SEL_GPIO},
    {0u, 18u, P7_2, HSIOM_SEL_GPIO},
    {0u, 19u, P7_3, HSIOM_SEL_GPIO},
    {0u, 20u, P7_4, HSIOM_SEL_GPIO},
    {0u, 21u, P7_5, HSIOM_SEL_GPIO},
    {0u, 22u, P7_6, HSIOM_SEL_GPIO},
    {0u, 23u, P7_7, HSIOM_SEL_GPIO},
    {0u, 24u, P8_1, HSIOM_SEL_GPIO},
    {0u, 25u, P8_2, HSIOM_SEL_GPIO},
    {0u, 26u, P8_3, HSIOM_SEL_GPIO},
    {0u, 27u, P8_4, HSIOM_SEL_GPIO},
    {0u, 28u, P9_0, HSIOM_SEL_GPIO},
    {0u, 29u, P9_1, HSIOM_SEL_GPIO},
    {0u, 30u, P9_2, HSIOM_SEL_GPIO},
    {0u, 31u, P9_3, HSIOM_SEL_GPIO},
    {1u, 0u, P10_4, HSIOM_SEL_GPIO},
    {1u, 1u, P10_5, HSIOM_SEL_GPIO},
    {1u, 2u, P10_6, HSIOM_SEL_GPIO},
    {1u, 3u, P10_7, HSIOM_SEL_GPIO},
    {1u, 4u, P12_0, HSIOM_SEL_GPIO},
    {1u, 5u, P12_1, HSIOM_SEL_GPIO},
    {1u, 6u, P12_2, HSIOM_SEL_GPIO},
    {1u, 7u, P12_3, HSIOM_SEL_GPIO},
    {1u, 8u, P12_4, HSIOM_SEL_GPIO},
    {1u, 9u, P12_5, HSIOM_SEL_GPIO},
    {1u, 10u, P12_6, HSIOM_SEL_GPIO},
    {1u, 11u, P12_7, HSIOM_SEL_GPIO},
    {1u, 12u, P13_0, HSIOM_SEL_GPIO},
    {1u, 13u, P13_1, HSIOM_SEL_GPIO},
    {1u, 14u, P13_2, HSIOM_SEL_GPIO},
    {1u, 15u, P13_3, HSIOM_SEL_GPIO},
    {1u, 16u, P13_4, HSIOM_SEL_GPIO},
    {1u, 17u, P13_5, HSIOM_SEL_GPIO},
    {1u, 18u, P13_6, HSIOM_SEL_GPIO},
    {1u, 19u, P13_7, HSIOM_SEL_GPIO},
    {1u, 20u, P14_0, HSIOM_SEL_GPIO},
    {1u, 21u, P14_1, HSIOM_SEL_GPIO},
    {1u, 22u, P14_2, HSIOM_SEL_GPIO},
    {1u, 23u, P14_3, HSIOM_SEL_GPIO},
    {1u, 24u, P14_4, HSIOM_SEL_GPIO},
    {1u, 25u, P14_5, HSIOM_SEL_GPIO},
    {1u, 26u, P14_6, HSIOM_SEL_GPIO},
    {1u, 27u, P14_7, HSIOM_SEL_GPIO},
    {1u, 28u, P15_0, HSIOM_SEL_GPIO},
    {1u, 29u, P15_1, HSIOM_SEL_GPIO},
    {1u, 30u, P15_2, HSIOM_SEL_GPIO},
    {1u, 31u, P15_3, HSIOM_SEL_GPIO},
    {2u, 0u, P16_0, HSIOM_SEL_GPIO},
    {2u, 1u, P16_1, HSIOM_SEL_GPIO},
    {2u, 2u, P16_2, HSIOM_SEL_GPIO},
    {2u, 3u, P16_3, HSIOM_SEL_GPIO},
    {2u, 4u, P16_4, HSIOM_SEL_GPIO},
    {2u, 5u, P16_5, HSIOM_SEL_GPIO},
    {2u, 6u, P16_6, HSIOM_SEL_GPIO},
    {2u, 7u, P16_7, HSIOM_SEL_GPIO},
    {2u, 8u, P17_0, HSIOM_SEL_GPIO},
    {2u, 9u, P17_1, HSIOM_SEL_GPIO},
    {2u, 10u, P17_2, HSIOM_SEL_GPIO},
    {2u, 11u, P17_3, HSIOM_SEL_GPIO},
    {2u, 12u, P17_4, HSIOM_SEL_GPIO},
    {2u, 13u, P17_5, HSIOM_SEL_GPIO},
    {2u, 14u, P17_6, HSIOM_SEL_GPIO},
    {2u, 15u, P17_7, HSIOM_SEL_GPIO},
    {2u, 16u, P18_0, HSIOM_SEL_GPIO},
    {2u, 17u, P18_1, HSIOM_SEL_GPIO},
    {2u, 18u, P18_2, HSIOM_SEL_GPIO},
    {2u, 19u, P18_3, HSIOM_SEL_GPIO},
    {2u, 20u, P18_4, HSIOM_SEL_GPIO},
    {2u, 21u, P18_5, HSIOM_SEL_GPIO},
    {2u, 22u, P18_6, HSIOM_SEL_GPIO},
    {2u, 23u, P18_7, HSIOM_SEL_GPIO},
    {2u, 24u, P19_0, HSIOM_SEL_GPIO},
    {2u, 25u, P19_1, HSIOM_SEL_GPIO},
    {2u, 26u, P19_2, HSIOM_SEL_GPIO},
    {2u, 27u, P19_3, HSIOM_SEL_GPIO},
    {2u, 28u, P19_4, HSIOM_SEL_GPIO},
    {2u, 29u, P20_0, HSIOM_SEL_GPIO},
    {2u, 30u, P20_1, HSIOM_SEL_GPIO},
    {2u, 31u, P20_2, HSIOM_SEL_GPIO},
    {0u, 8u, P32_0, HSIOM_SEL_GPIO},
    {0u, 9u, P32_1, HSIOM_SEL_GPIO},
    {0u, 10u, P32_2, HSIOM_SEL_GPIO},
    {0u, 11u, P32_3, HSIOM_SEL_GPIO},
    {0u, 12u, P32_4, HSIOM_SEL_GPIO},
    {0u, 13u, P32_5, HSIOM_SEL_GPIO},
    {0u, 14u, P32_6, HSIOM_SEL_GPIO},
    {0u, 15u, P32_7, HSIOM_SEL_GPIO},
};

/* Connections for: peri_tr_io_input */
/* The actual channel_num has no value to how the connection works. However, the HAL driver needs
   to know the index of the input or output trigger line. Store that in the channel_num field
   instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_input[48] = {
    {0u, 0u, P1_2, P1_2_PERI_TR_IO_INPUT0},
    {0u, 1u, P1_3, P1_3_PERI_TR_IO_INPUT1},
    {0u, 2u, P2_0, P2_0_PERI_TR_IO_INPUT2},
    {0u, 3u, P2_1, P2_1_PERI_TR_IO_INPUT3},
    {0u, 4u, P2_2, P2_2_PERI_TR_IO_INPUT4},
    {0u, 5u, P2_3, P2_3_PERI_TR_IO_INPUT5},
    {0u, 6u, P2_4, P2_4_PERI_TR_IO_INPUT6},
    {0u, 7u, P2_5, P2_5_PERI_TR_IO_INPUT7},
    {0u, 10u, P4_0, P4_0_PERI_TR_IO_INPUT10},
    {0u, 11u, P4_1, P4_1_PERI_TR_IO_INPUT11},
    {0u, 12u, P4_2, P4_2_PERI_TR_IO_INPUT12},
    {0u, 13u, P4_3, P4_3_PERI_TR_IO_INPUT13},
    {0u, 32u, P4_5, P4_5_PERI_TR_IO_INPUT32},
    {0u, 33u, P4_6, P4_6_PERI_TR_IO_INPUT33},
    {0u, 38u, P5_0, P5_0_PERI_TR_IO_INPUT38},
    {0u, 39u, P5_1, P5_1_PERI_TR_IO_INPUT39},
    {0u, 8u, P6_6, P6_6_PERI_TR_IO_INPUT8},
    {0u, 9u, P6_7, P6_7_PERI_TR_IO_INPUT9},
    {0u, 16u, P7_6, P7_6_PERI_TR_IO_INPUT16},
    {0u, 17u, P7_7, P7_7_PERI_TR_IO_INPUT17},
    {0u, 14u, P8_1, P8_1_PERI_TR_IO_INPUT14},
    {0u, 15u, P8_2, P8_2_PERI_TR_IO_INPUT15},
    {0u, 18u, P10_0, P10_0_PERI_TR_IO_INPUT18},
    {0u, 19u, P10_1, P10_1_PERI_TR_IO_INPUT19},
    {0u, 20u, P12_0, P12_0_PERI_TR_IO_INPUT20},
    {0u, 21u, P12_1, P12_1_PERI_TR_IO_INPUT21},
    {0u, 22u, P13_6, P13_6_PERI_TR_IO_INPUT22},
    {0u, 23u, P13_7, P13_7_PERI_TR_IO_INPUT23},
    {0u, 24u, P14_6, P14_6_PERI_TR_IO_INPUT24},
    {0u, 25u, P14_7, P14_7_PERI_TR_IO_INPUT25},
    {0u, 26u, P17_3, P17_3_PERI_TR_IO_INPUT26},
    {0u, 27u, P17_4, P17_4_PERI_TR_IO_INPUT27},
    {0u, 28u, P19_2, P19_2_PERI_TR_IO_INPUT28},
    {0u, 29u, P19_3, P19_3_PERI_TR_IO_INPUT29},
    {0u, 30u, P23_3, P23_3_PERI_TR_IO_INPUT30},
    {0u, 31u, P23_4, P23_4_PERI_TR_IO_INPUT31},
    {0u, 34u, P30_0, P30_0_PERI_TR_IO_INPUT34},
    {0u, 35u, P30_1, P30_1_PERI_TR_IO_INPUT35},
    {0u, 36u, P30_2, P30_2_PERI_TR_IO_INPUT36},
    {0u, 37u, P30_3, P30_3_PERI_TR_IO_INPUT37},
    {0u, 40u, P32_0, P32_0_PERI_TR_IO_INPUT40},
    {0u, 41u, P32_1, P32_1_PERI_TR_IO_INPUT41},
    {0u, 42u, P32_2, P32_2_PERI_TR_IO_INPUT42},
    {0u, 43u, P32_3, P32_3_PERI_TR_IO_INPUT43},
    {0u, 44u, P32_4, P32_4_PERI_TR_IO_INPUT44},
    {0u, 45u, P32_5, P32_5_PERI_TR_IO_INPUT45},
    {0u, 46u, P32_6, P32_6_PERI_TR_IO_INPUT46},
    {0u, 47u, P32_7, P32_7_PERI_TR_IO_INPUT47},
};

