RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7200_320_bga.c
/* Connections for: peri_tr_io_output */
/* The actual channel_num has no value to how the connection works. However, the HAL driver needs
   to know the index of the input or output trigger line. Store that in the channel_num field
   instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_output[6] = {
    {0u, 0u, P3_0, P3_0_PERI_TR_IO_OUTPUT0},
    {0u, 1u, P3_1, P3_1_PERI_TR_IO_OUTPUT1},
    {0u, 0u, P8_3, P8_3_PERI_TR_IO_OUTPUT0},
    {0u, 1u, P8_4, P8_4_PERI_TR_IO_OUTPUT1},
    {0u, 1u, P21_2, P21_2_PERI_TR_IO_OUTPUT1},
    {0u, 0u, P23_4, P23_4_PERI_TR_IO_OUTPUT0},
};

/* Connections for: scb_i2c_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_scl[23] = {
    {7u, 0u, P0_1, P0_1_SCB7_I2C_SCL},
    {0u, 0u, P0_2, P0_2_SCB0_I2C_SCL},
    {0u, 0u, P1_0, P1_0_SCB0_I2C_SCL},
    {8u, 0u, P1_6, P1_6_SCB8_I2C_SCL},
    {7u, 0u, P2_2, P2_2_SCB7_I2C_SCL},
    {6u, 0u, P3_2, P3_2_SCB6_I2C_SCL},
    {5u, 0u, P4_2, P4_2_SCB5_I2C_SCL},
    {4u, 0u, P6_2, P6_2_SCB4_I2C_SCL},
    {5u, 0u, P7_2, P7_2_SCB5_I2C_SCL},
    {4u, 0u, P10_2, P10_2_SCB4_I2C_SCL},
    {8u, 0u, P12_2, P12_2_SCB8_I2C_SCL},
    {3u, 0u, P13_2, P13_2_SCB3_I2C_SCL},
    {2u, 0u, P14_2, P14_2_SCB2_I2C_SCL},
    {9u, 0u, P15_2, P15_2_SCB9_I2C_SCL},
    {3u, 0u, P17_3, P17_3_SCB3_I2C_SCL},
    {1u, 0u, P18_2, P18_2_SCB1_I2C_SCL},
    {2u, 0u, P19_2, P19_2_SCB2_I2C_SCL},
    {1u, 0u, P20_5, P20_5_SCB1_I2C_SCL},
    {6u, 0u, P22_2, P22_2_SCB6_I2C_SCL},
    {7u, 0u, P23_2, P23_2_SCB7_I2C_SCL},
    {10u, 0u, P28_2, P28_2_SCB10_I2C_SCL},
    {9u, 0u, P30_0, P30_0_SCB9_I2C_SCL},
    {10u, 0u, P32_2, P32_2_SCB10_I2C_SCL},
};

/* Connections for: scb_i2c_sda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_sda[23] = {
    {7u, 0u, P0_0, P0_0_SCB7_I2C_SDA},
    {0u, 0u, P0_3, P0_3_SCB0_I2C_SDA},
    {0u, 0u, P1_1, P1_1_SCB0_I2C_SDA},
    {8u, 0u, P1_5, P1_5_SCB8_I2C_SDA},
    {7u, 0u, P2_1, P2_1_SCB7_I2C_SDA},
    {6u, 0u, P3_1, P3_1_SCB6_I2C_SDA},
    {5u, 0u, P4_1, P4_1_SCB5_I2C_SDA},
    {9u, 0u, P4_6, P4_6_SCB9_I2C_SDA},
    {4u, 0u, P6_1, P6_1_SCB4_I2C_SDA},
    {5u, 0u, P7_1, P7_1_SCB5_I2C_SDA},
    {4u, 0u, P10_1, P10_1_SCB4_I2C_SDA},
    {8u, 0u, P12_1, P12_1_SCB8_I2C_SDA},
    {3u, 0u, P13_1, P13_1_SCB3_I2C_SDA},
    {2u, 0u, P14_1, P14_1_SCB2_I2C_SDA},
    {9u, 0u, P15_1, P15_1_SCB9_I2C_SDA},
    {3u, 0u, P17_2, P17_2_SCB3_I2C_SDA},
    {1u, 0u, P18_1, P18_1_SCB1_I2C_SDA},
    {2u, 0u, P19_1, P19_1_SCB2_I2C_SDA},
    {1u, 0u, P20_4, P20_4_SCB1_I2C_SDA},
    {6u, 0u, P22_1, P22_1_SCB6_I2C_SDA},
    {7u, 0u, P23_1, P23_1_SCB7_I2C_SDA},
    {10u, 0u, P28_1, P28_1_SCB10_I2C_SDA},
    {10u, 0u, P32_1, P32_1_SCB10_I2C_SDA},
};

/* Connections for: scb_spi_m_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_clk[25] = {
    {0u, 0u, P0_2, P0_2_SCB0_SPI_CLK},
    {4u, 0u, P1_0, P1_0_SCB4_SPI_CLK},
    {0u, 0u, P1_2, P1_2_SCB0_SPI_CLK},
    {8u, 0u, P1_6, P1_6_SCB8_SPI_CLK},
    {7u, 0u, P2_2, P2_2_SCB7_SPI_CLK},
    {6u, 0u, P3_2, P3_2_SCB6_SPI_CLK},
    {5u, 0u, P4_2, P4_2_SCB5_SPI_CLK},
    {4u, 0u, P6_2, P6_2_SCB4_SPI_CLK},
    {5u, 0u, P7_2, P7_2_SCB5_SPI_CLK},
    {4u, 0u, P10_2, P10_2_SCB4_SPI_CLK},
    {8u, 0u, P12_2, P12_2_SCB8_SPI_CLK},
    {3u, 0u, P13_2, P13_2_SCB3_SPI_CLK},
    {2u, 0u, P14_2, P14_2_SCB2_SPI_CLK},
    {9u, 0u, P15_2, P15_2_SCB9_SPI_CLK},
    {3u, 0u, P17_3, P17_3_SCB3_SPI_CLK},
    {1u, 0u, P18_2, P18_2_SCB1_SPI_CLK},
    {3u, 0u, P18_3, P18_3_SCB3_SPI_CLK},
    {2u, 0u, P19_2, P19_2_SCB2_SPI_CLK},
    {1u, 0u, P20_5, P20_5_SCB1_SPI_CLK},
    {6u, 0u, P22_2, P22_2_SCB6_SPI_CLK},
    {7u, 0u, P23_2, P23_2_SCB7_SPI_CLK},
    {2u, 0u, P23_6, P23_6_SCB2_SPI_CLK},
    {10u, 0u, P28_2, P28_2_SCB10_SPI_CLK},
    {9u, 0u, P30_0, P30_0_SCB9_SPI_CLK},
    {10u, 0u, P32_2, P32_2_SCB10_SPI_CLK},
};

/* Connections for: scb_spi_m_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_miso[24] = {
    {0u, 0u, P0_0, P0_0_SCB0_SPI_MISO},
    {4u, 0u, P0_2, P0_2_SCB4_SPI_MISO},
    {0u, 0u, P1_0, P1_0_SCB0_SPI_MISO},
    {8u, 0u, P1_4, P1_4_SCB8_SPI_MISO},
    {7u, 0u, P2_0, P2_0_SCB7_SPI_MISO},
    {6u, 0u, P3_0, P3_0_SCB6_SPI_MISO},
    {5u, 0u, P4_0, P4_0_SCB5_SPI_MISO},
    {9u, 0u, P4_5, P4_5_SCB9_SPI_MISO},
    {4u, 0u, P6_0, P6_0_SCB4_SPI_MISO},
    {5u, 0u, P7_0, P7_0_SCB5_SPI_MISO},
    {4u, 0u, P10_0, P10_0_SCB4_SPI_MISO},
    {8u, 0u, P12_0, P12_0_SCB8_SPI_MISO},
    {3u, 0u, P13_0, P13_0_SCB3_SPI_MISO},
    {2u, 0u, P14_0, P14_0_SCB2_SPI_MISO},
    {9u, 0u, P15_0, P15_0_SCB9_SPI_MISO},
    {1u, 0u, P18_0, P18_0_SCB1_SPI_MISO},
    {3u, 0u, P18_1, P18_1_SCB3_SPI_MISO},
    {2u, 0u, P19_0, P19_0_SCB2_SPI_MISO},
    {1u, 0u, P20_3, P20_3_SCB1_SPI_MISO},
    {6u, 0u, P21_7, P21_7_SCB6_SPI_MISO},
    {7u, 0u, P23_0, P23_0_SCB7_SPI_MISO},
    {2u, 0u, P23_4, P23_4_SCB2_SPI_MISO},
    {10u, 0u, P28_0, P28_0_SCB10_SPI_MISO},
    {10u, 0u, P32_0, P32_0_SCB10_SPI_MISO},
};

/* Connections for: scb_spi_m_mosi */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_mosi[24] = {
    {0u, 0u, P0_1, P0_1_SCB0_SPI_MOSI},
    {4u, 0u, P0_3, P0_3_SCB4_SPI_MOSI},
    {0u, 0u, P1_1, P1_1_SCB0_SPI_MOSI},
    {8u, 0u, P1_5, P1_5_SCB8_SPI_MOSI},
    {7u, 0u, P2_1, P2_1_SCB7_SPI_MOSI},
    {6u, 0u, P3_1, P3_1_SCB6_SPI_MOSI},
    {5u, 0u, P4_1, P4_1_SCB5_SPI_MOSI},
    {9u, 0u, P4_6, P4_6_SCB9_SPI_MOSI},
    {4u, 0u, P6_1, P6_1_SCB4_SPI_MOSI},
    {5u, 0u, P7_1, P7_1_SCB5_SPI_MOSI},
    {4u, 0u, P10_1, P10_1_SCB4_SPI_MOSI},
    {8u, 0u, P12_1, P12_1_SCB8_SPI_MOSI},
    {3u, 0u, P13_1, P13_1_SCB3_SPI_MOSI},
    {2u, 0u, P14_1, P14_1_SCB2_SPI_MOSI},
    {9u, 0u, P15_1, P15_1_SCB9_SPI_MOSI},
    {1u, 0u, P18_1, P18_1_SCB1_SPI_MOSI},
    {3u, 0u, P18_2, P18_2_SCB3_SPI_MOSI},
    {2u, 0u, P19_1, P19_1_SCB2_SPI_MOSI},
    {1u, 0u, P20_4, P20_4_SCB1_SPI_MOSI},
    {6u, 0u, P22_1, P22_1_SCB6_SPI_MOSI},
    {7u, 0u, P23_1, P23_1_SCB7_SPI_MOSI},
    {2u, 0u, P23_5, P23_5_SCB2_SPI_MOSI},
    {10u, 0u, P28_1, P28_1_SCB10_SPI_MOSI},
    {10u, 0u, P32_1, P32_1_SCB10_SPI_MOSI},
};

/* Connections for: scb_spi_m_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select0[25] = {
    {0u, 0u, P0_3, P0_3_SCB0_SPI_SELECT0},
    {4u, 0u, P1_1, P1_1_SCB4_SPI_SELECT0},
    {0u, 0u, P1_3, P1_3_SCB0_SPI_SELECT0},
    {7u, 0u, P2_3, P2_3_SCB7_SPI_SELECT0},
    {8u, 0u, P2_6, P2_6_SCB8_SPI_SELECT0},
    {6u, 0u, P3_3, P3_3_SCB6_SPI_SELECT0},
    {5u, 0u, P4_3, P4_3_SCB5_SPI_SELECT0},
    {4u, 0u, P6_3, P6_3_SCB4_SPI_SELECT0},
    {5u, 0u, P7_3, P7_3_SCB5_SPI_SELECT0},
    {4u, 0u, P10_3, P10_3_SCB4_SPI_SELECT0},
    {8u, 0u, P12_3, P12_3_SCB8_SPI_SELECT0},
    {3u, 0u, P13_3, P13_3_SCB3_SPI_SELECT0},
    {2u, 0u, P14_3, P14_3_SCB2_SPI_SELECT0},
    {9u, 0u, P15_3, P15_3_SCB9_SPI_SELECT0},
    {3u, 0u, P17_4, P17_4_SCB3_SPI_SELECT0},
    {1u, 0u, P18_3, P18_3_SCB1_SPI_SELECT0},
    {3u, 0u, P18_4, P18_4_SCB3_SPI_SELECT0},
    {2u, 0u, P19_3, P19_3_SCB2_SPI_SELECT0},
    {1u, 0u, P20_6, P20_6_SCB1_SPI_SELECT0},
    {6u, 0u, P22_3, P22_3_SCB6_SPI_SELECT0},
    {7u, 0u, P23_3, P23_3_SCB7_SPI_SELECT0},
    {2u, 0u, P23_7, P23_7_SCB2_SPI_SELECT0},
    {10u, 0u, P28_3, P28_3_SCB10_SPI_SELECT0},
    {9u, 0u, P30_1, P30_1_SCB9_SPI_SELECT0},
    {10u, 0u, P32_3, P32_3_SCB10_SPI_SELECT0},
};

/* Connections for: scb_spi_m_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select1[21] = {
    {0u, 0u, P2_0, P2_0_SCB0_SPI_SELECT1},
    {7u, 0u, P2_4, P2_4_SCB7_SPI_SELECT1},
    {8u, 0u, P2_7, P2_7_SCB8_SPI_SELECT1},
    {6u, 0u, P3_4, P3_4_SCB6_SPI_SELECT1},
    {5u, 0u, P4_4, P4_4_SCB5_SPI_SELECT1},
    {4u, 0u, P6_4, P6_4_SCB4_SPI_SELECT1},
    {5u, 0u, P7_4, P7_4_SCB5_SPI_SELECT1},
    {4u, 0u, P10_4, P10_4_SCB4_SPI_SELECT1},
    {8u, 0u, P12_4, P12_4_SCB8_SPI_SELECT1},
    {3u, 0u, P13_4, P13_4_SCB3_SPI_SELECT1},
    {2u, 0u, P14_4, P14_4_SCB2_SPI_SELECT1},
    {9u, 0u, P16_0, P16_0_SCB9_SPI_SELECT1},
    {3u, 0u, P17_5, P17_5_SCB3_SPI_SELECT1},
    {1u, 0u, P18_4, P18_4_SCB1_SPI_SELECT1},
    {2u, 0u, P19_4, P19_4_SCB2_SPI_SELECT1},
    {1u, 0u, P20_7, P20_7_SCB1_SPI_SELECT1},
    {6u, 0u, P22_4, P22_4_SCB6_SPI_SELECT1},
    {7u, 0u, P23_4, P23_4_SCB7_SPI_SELECT1},
    {10u, 0u, P28_4, P28_4_SCB10_SPI_SELECT1},
    {9u, 0u, P30_2, P30_2_SCB9_SPI_SELECT1},
    {10u, 0u, P32_4, P32_4_SCB10_SPI_SELECT1},
};

